In [ ]:
###TESTING CONNECTION TO OUR AMAZON REDSHIFT DATABASE####

In [ ]:
import configparser
import psycopg2
%load_ext sql

In [12]:
config = ConfigParser()
config.read_file(open('credentials.cfg'))
KEY=config.get('AWS','key')
SECRET= config.get('AWS','secret')

DWH_DB= config.get("CLUSTER","DWH_DB")
DWH_DB_USER= config.get("CLUSTER","DWH_DB_USER")
DWH_DB_PASSWORD= config.get("CLUSTER","DWH_DB_PASSWORD")
DWH_PORT = config.get("CLUSTER","DWH_PORT")

In [11]:
# FILL IN YOUR REDSHIFT ENDPOINT HERE
DWH_ENDPOINT=""
    
#FILL IN YOUR IAM ROLE ARN
DWH_ROLE_ARN=""

In [13]:
%load_ext sql
import psycopg2
import os 
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://awsuser:Iyinola1@redshift-cluster.c7iloqytfgwn.us-west-2.redshift.amazonaws.com:5439/dev

'Connected: awsuser@dev'

**- Extract / Check from different tables from the UK- Accident-Data Star Schema**

In [16]:
%%sql
SELECT * FROM condition
LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.c7iloqytfgwn.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('49', 'Snowing without high winds', 'Daylight: Street light present', 'Frost/Ice'),
 ('179', 'Fine with high winds', 'Daylight: Street light present', 'Frost/Ice'),
 ('61', 'Unknown', 'Darkness: Street lights present and lit', 'Wet/Damp'),
 ('124', 'Unknown', 'Daylight: Street light present', 'Wet/Damp'),
 ('163', 'Snowing with high winds', 'Darkness: Street lights present and lit', 'Wet/Damp')]

In [17]:
%%sql
SELECT * FROM accident
LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.c7iloqytfgwn.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('2.01E+12', 'E10000020', datetime.datetime(2005, 1, 1, 1, 35), 2005, 36, 3, 1, 1, 1161, 30, 0, 2, 'Yes', 160, 69, 18),
 ('2.01E+12', 'E10000020', datetime.datetime(2005, 1, 1, 4, 21), 2005, 36, 1, 1, 4, 134, 30, 0, 1, 'Yes', 158, 129, 18),
 ('200550E31A063', 'E06000026', datetime.datetime(2005, 1, 1, 10, 50), 2005, 50, 3, 1, 1, 0, 30, 0, 1, 'Yes', 175, 223, 18),
 ('200501KG70002', 'E09000002', datetime.datetime(2005, 1, 1, 12, 35), 2005, 1, 3, 1, 1, 0, 30, 0, 1, 'Yes', 127, 209, 18),
 ('2.01E+12', 'W06000013', datetime.datetime(2005, 1, 1, 14, 5), 2005, 62, 3, 1, 2, 4064, 40, 0, 2, 'Yes', 8, 129, 18)]

- **Extract / Check from different tables from the UK- Traffic - Aggregated Tables**

In [18]:
%%sql
SELECT * FROM motor_vehicles
LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.c7iloqytfgwn.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(2000, 'Sheffield', 'Yorkshire and the Humber', 'A6178', Decimal('131.40'), Decimal('14614.20'), Decimal('523.20'), Decimal('2998.20'), Decimal('12702.00'), Decimal('1749299.00'), Decimal('33580.00'), Decimal('267326.00')),
 (2001, 'Leeds', 'Yorkshire and the Humber', 'A61', Decimal('152.88'), Decimal('19098.22'), Decimal('421.11'), Decimal('2490.44'), Decimal('21453.88'), Decimal('3060160.00'), Decimal('46801.11'), Decimal('308668.33')),
 (2003, 'North Yorkshire', 'Yorkshire and the Humber', 'A1039', Decimal('84.50'), Decimal('5280.50'), Decimal('70.00'), Decimal('728.50'), Decimal('88512.50'), Decimal('5784155.00'), Decimal('66430.00'), Decimal('866327.50')),
 (2004, 'Calderdale', 'Yorkshire and the Humber', 'A6107', Decimal('88.00'), Decimal('10349.00'), Decimal('33.00'), Decimal('1334.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00')),
 (2005, 'Sheffield', 'Yorkshire and the Humber', 'A6178', Decimal('153.00'), Decimal('14918.80'), Decimal('399.60'), Decimal('2958.00'), Decimal('10074.00'), Decimal('1858215.00'), Decimal('30441.00'), Decimal('268640.00'))]

In [19]:
%%sql
SELECT * FROM pedal_cycle
LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.c7iloqytfgwn.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(2000, 'Sheffield', 'Yorkshire and the Humber', 'A6178', Decimal('76.20'), Decimal('4818.00')),
 (2001, 'Leeds', 'Yorkshire and the Humber', 'A61', Decimal('74.55'), Decimal('8151.66')),
 (2003, 'North Yorkshire', 'Yorkshire and the Humber', 'A1039', Decimal('27.50'), Decimal('23360.00')),
 (2004, 'Calderdale', 'Yorkshire and the Humber', 'A6107', Decimal('2.00'), Decimal('0.00')),
 (2005, 'Sheffield', 'Yorkshire and the Humber', 'A6178', Decimal('56.00'), Decimal('2336.00'))]